'''a)Дан текстовий файл f. Переписати у файл g всі рядки з вихідного файлу, в кінці
кожного рядка додавши знак оклику (!).
б) Дано текстові файли f і g. Записати в файл h спочатку компоненти файлу f, потім
- компоненти файлу g зі збереженням порядку.'''


#Відкриваємо файли f і g
file1=open('f.txt','r+',encoding='utf-8')
file2=open('g.txt','r+', encoding='utf-8')
#Показ вмісту файла-імпортера (f)
print('Вміст файла (f):')
print()
print(file1.read())
#Після прочитання вмісту повертаємось на початок
file1.seek(0)
print()
#Створюємо список елементами якого є строки файла f
print('Перетворення вмісту файла (f):')
print()
s=file1.readlines()
#Показ цього списку
print(s)
#Проходимо по елементах списку та додаємо знак оклику
for i in s:
    #Останній елемент не має знака \n, отже його не потрібно обрізати-відразу додаємо знак оклику
    if s.index(i)==len(s)-1:
        i+='!'
    i=i[:-1]
    i+='!'
# Записуємо у файл g отриманні данні
    file2.write(f'{i}\n')
#Повертаємось на початок вмісту
file2.seek(0)
print()
print('Вміст файла(g):')
print()
print(file2.read())
#Зберігаємо зміни у файлах f і g
file1.close()
file2.close()
#Відкриваємо файли f,g,h
file1 = open('f.txt', 'r+', encoding='utf-8')
file2 = open('g.txt', 'r+', encoding='utf-8')
file3 = open('h.txt', 'r+', encoding='utf-8')
file2.seek(0)
k=file2.readlines()
print('Перетворення вмісту файла (g):')
print()
print(k)
'''Знову проходимо по елементах цього списку, але на останньому додаємо \n, 
тому що попередього разу s не мав переносу на новий рядок для останнього елемента
і якщо цього не зробити тепер, то 5-та стрічка файла (f) і 1-ша стрічка файла (g),
при об'єднанні у файлі (h) опиняться в одному рядку'''
for i in s:
    if s.index(i)==len(s)-1:
        file3.write(f'{i}\n')
        break
    file3.write(f'{i}')
for y in k:
    file3.write(f'{y}')
#Повертаємось на початок вмісту
file3.seek(0)
print()
print('Вміст файла (h):')
print()
print(file3.read())
file1.close()
file2.close()
file3.close()


